In [34]:
import pandas as pd
import numpy as np
from imblearn.under_sampling import TomekLinks

In [29]:
df  = pd.read_csv('/Users/bianca/Documents/Itaú - Análise de Crédito/Inputs/credit_analysis_data.csv')

In [30]:
df.shape

(1000, 14)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Age                   1000 non-null   int64
 1   Income                1000 non-null   int64
 2   Loan Amount           1000 non-null   int64
 3   Loan Term             1000 non-null   int64
 4   Credit Score          1000 non-null   int64
 5   Number of Defaults    1000 non-null   int64
 6   Education Level       1000 non-null   object
 7   Employment Status     1000 non-null   object
 8   Marital Status        1000 non-null   object
 9   Number of Dependents  1000 non-null   int64
 10  Home Ownership        1000 non-null   object
 11  Years in Residence    1000 non-null   int64
 12  Annual Expenses       1000 non-null   int64
 13  Default Probability   1000 non-null   int64
dtypes: int64(10), object(4)
memory usage: 109.5+ KB

In [12]:
df.head()

,Age,Income,Loan Amount,Loan Term,Credit Score,Number of Defaults,Education Level,Employment Status,Marital Status,Number of Dependents,Home Ownership,Years in Residence,Annual Expenses,Default Probability
0,56,25903,37269,47,761,3,PhD,Employed,Married,5,Rent,28,20629,1
1,69,53051,16003,54,312,0,Bachelor,Employed,Single,1,Mortgage,12,41678,0
2,46,38654,22246,48,683,3,Bachelor,Employed,Married,3,Own,7,20467,0
3,32,28666,29325,26,698,1,Bachelor,Employed,Married,1,Own,21,39952,0
4,60,40301,5816,39,318,2,PhD,Employed,Single,3,Own,20,29884,0

In [18]:
df.describe()

,Age,Income,Loan Amount,Loan Term,Credit Score,Number of Defaults,Number of Dependents,Years in Residence,Annual Expenses,Default Probability
count,1000.00000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,43.81900,50863.121000,20203.059000,35.661000,578.81400,2.006000,2.548000,14.777000,30039.377000,0.197000
std,14.99103,14823.257362,9809.574573,13.686248,158.33446,1.418441,1.710152,8.606587,9864.135905,0.397931
min,18.00000,6556.000000,-10195.000000,12.000000,300.00000,0.000000,0.000000,0.000000,-2173.000000,0.000000
25%,31.00000,40822.250000,13585.000000,24.000000,443.00000,1.000000,1.000000,7.000000,22985.000000,0.000000
50%,44.00000,50807.000000,20038.000000,35.000000,582.00000,2.000000,3.000000,15.000000,30190.000000,0.000000
75%,56.00000,60281.750000,26842.000000,48.000000,722.00000,3.000000,4.000000,23.000000,36921.750000,0.000000
max,69.00000,89485.000000,51931.000000,59.000000,849.00000,4.000000,5.000000,29.000000,57345.000000,1.000000

In [19]:
#Verifica se há valores nulos
df.isnull().sum()

Age                     0
Income                  0
Loan Amount             0
Loan Term               0
Credit Score            0
Number of Defaults      0
Education Level         0
Employment Status       0
Marital Status          0
Number of Dependents    0
Home Ownership          0
Years in Residence      0
Annual Expenses         0
Default Probability     0
dtype: int64

In [20]:
#Verifica se há duplicados
df.duplicated().sum()

np.int64(0)

In [23]:
#Verifica quantos valores distintos há em cada coluna
df.nunique()

Age                      52
Income                  994
Loan Amount             987
Loan Term                48
Credit Score            458
Number of Defaults        5
Education Level           4
Employment Status         3
Marital Status            4
Number of Dependents      6
Home Ownership            3
Years in Residence       30
Annual Expenses         988
Default Probability       2
dtype: int64

In [32]:
# verifica o balanceamento das classes
#Conclusão: classe desbalanceada. 

df['Default Probability'].value_counts()

Default Probability
0    803
1    197
Name: count, dtype: int64